## Read entire CSV

In [14]:
import pandas as pd
data = pd.read_csv('Test.csv')
data

     Name  Age      City
0   Vivek   23      Pune
1     Ram   40  Banglore
2   Ankit   32     Delhi
3    Sham   62    Mumbai
4  Suresh   17     Surat
5   Kunal   59    Jaipur

## To limit no. of rows

In [15]:
data = pd.read_csv('Test.csv', nrows=3)
data

    Name  Age      City
0  Vivek   23      Pune
1    Ram   40  Banglore
2  Ankit   32     Delhi

## To select specific columns

In [16]:
# Using column name
data = pd.read_csv('Test.csv', usecols = ['Name', 'Age'])
# OR
# Using column index
# data = pd.read_csv('Test.csv', usecols = [0, 1])
data

     Name  Age
0   Vivek   23
1     Ram   40
2   Ankit   32
3    Sham   62
4  Suresh   17
5   Kunal   59

## To skip rows

In [21]:
data = pd.read_csv('Test.csv', skiprows = [1, 3])
data

     Name  Age      City
0     Ram   40  Banglore
1    Sham   62    Mumbai
2  Suresh   17     Surat
3   Kunal   59    Jaipur

## Use column as an index

In [30]:
data = pd.read_csv('Test.csv', index_col = 'Age')
print(data)
data['Name'][17]

       Name      City
Age
23    Vivek      Pune
40      Ram  Banglore
32    Ankit     Delhi
62     Sham    Mumbai
17   Suresh     Surat
59    Kunal    Jaipur

'Suresh'

## Use row as a header
- Note thtat it will skip all the values above it

In [25]:
data = pd.read_csv('Test.csv', header = 3)
data

    Ankit  32   Delhi
0    Sham  62  Mumbai
1  Suresh  17   Surat
2   Kunal  59  Jaipur

## Assign custom column name

In [31]:
data = pd.read_csv('Test.csv', names = ['Candidate', 'Experience', 'Location'])
data

  Candidate Experience  Location
0      Name        Age      City
1     Vivek         23      Pune
2       Ram         40  Banglore
3     Ankit         32     Delhi
4      Sham         62    Mumbai
5    Suresh         17     Surat
6     Kunal         59    Jaipur

## Change columnwise Data type

In [35]:
data = pd.read_csv('Test.csv', dtype = {'Age': float, 'City':str})
data

     Name   Age      City
0   Vivek  23.0      Pune
1     Ram  40.0  Banglore
2   Ankit  32.0     Delhi
3    Sham  62.0    Mumbai
4  Suresh  17.0     Surat
5   Kunal  59.0    Jaipur